Enterprise_Serivces/Prod/SilverGroup1/CSLAllSparkCatalogService/result1/Iteration1/t4_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><CorrelationID xmlns="http://www.gamestop.com/CSL/AllSparkCatalog/V1.0">3408e959-5454-4a39-bbc6-ba0d62f3d82e</CorrelationID><MachineName xmlns="http://www.gamestop.com/CSL/AllSparkCatalog/V1.0">test</MachineName><wsa:Action>http://www.gamestop.com/CSL/AllSparkCatalog/V1.0/DigitalCatalogService_v1/GetInventoryCountByAllSparkId</wsa:Action><wsa:MessageID>uuid:24a80cbf-0549-43e5-aacc-c7857e16287a</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://cslallsparkcatalogserviceqa1.testgs.pvt/DigitalCatalogService.svc</wsa:To></soap:Header><soap:Body><GetInventoryCountRequest xmlns="http://www.gamestop.com/CSL/AllSparkCatalog/V1.0"><allSparkID>20140</allSparkID><partnerKey>TEST-US</partnerKey></GetInventoryCountRequest></soap:Body></soap:Envelope>